;//---------------------------------------------------------------------------------------
;//  AUTHOR:  Lt A.Kouassi
;//--------------------------------------------------------------------------------------- 

;//Place localized text in this file

[WOTC_OfficerClass X2SoldierClassTemplate]
+DisplayName="军官"
+ClassSummary="这位军官担任我们的小队领导，能够提供额外的士气和支持。他们还接受了手枪和剑的使用训练，并可以培训技能以进一步支持自己的部队。"
+LeftAbilityTreeTitle="战斗效率"
+RightAbilityTreeTitle="战术选项"
+AbilityTreeTitles[0]="战斗效率"
+AbilityTreeTitles[1]="战术命令"
+AbilityTreeTitles[2]="特殊技能"

+RankNames[0]="实习军官"
+RankNames[1]="实习军官"
+RankNames[2]="少尉"
+RankNames[3]="中尉"
+RankNames[4]="上尉"
+RankNames[5]="少校"
+RankNames[6]="中校"
+RankNames[7]="上校"

+ShortNames[0]="Ocdt."
+ShortNames[1]="Ocdt."
+ShortNames[2]="2Lt."
+ShortNames[3]="Lt."
+ShortNames[4]="Cpt.."
+ShortNames[5]="Maj."
+ShortNames[6]="Lt Col."
+ShortNames[7]="Col."

+RankIcons[0]="UI_Library_Officer.Rank_Officer_Cadet_O"
+RankIcons[1]="UI_Library_Officer.Rank_Officer_Cadet_O"
+RankIcons[2]="UI_Library_Officer.Rank_Lieutenant_2nd_O"
+RankIcons[3]="UI_Library_Officer.Rank_Lieutenant_O"
+RankIcons[4]="UI_Library_Officer.Rank_Captain_O"
+RankIcons[5]="UI_Library_Officer.Rank_Major_O"
+RankIcons[6]="UI_Library_Officer.Rank_Lieutenant_Colonel_O"
+RankIcons[7]="UI_Library_Officer.Rank_Colonel_O"


[WOTC_OfficerClass X2EncyclopediaTemplate]
+ListTitle="军官"
+DescriptionTitle="军官"
+DescriptionEntry="这位军官担任我们的小队领导，能够提供额外的士气和支持。他们还接受了手枪和剑的使用训练，并可以培训技能以进一步支持自己的部队。"

[OfficerCoveringFire X2AbilityTemplate]
+LocFriendlyName="火力掩护"
+LocLongDescription="军官向附近的士兵下达命令，提供掩护火力，他们将进入监视射击状态。"
+LocHelpText="让附近的士兵进入监视射击状态。"
+LocFlyOverText="火力掩护"
+LocPromotionPopupText="让附近的士兵进入监视射击状态。<br/>"

[OfficerTacticalRigging X2AbilityTemplate]
+LocFriendlyName="战术装备"
+LocHelpText="提供一个额外的通用槽位。"
+LocLongDescription="提供一个额外的通用槽位。"
+LocPromotionPopupText="<Bullet/> 提供一个额外的通用槽位。<br/>"

[OfficerLoyalty X2AbilityTemplate]
LocFriendlyName="忠诚"
LocLongDescription="这位军官对他的部队和XCOM全心投入。+5意志力。"
LocHelpText="+10意志力。"
LocFlyOverText="忠诚"
LocPromotionPopupText="+10意志力。<br/>"

[OfficerBinoculars X2AbilityTemplate]
+LocFriendlyName="望远镜"
+LocLongDescription="提供额外的视野范围。"
+LocHelpText="视线范围+5，持续1回合。"
+LocFlyOverText="望远镜"
+LocPromotionPopupText="<Bullet/> 随着军官视野范围的增加，您可以更容易地从安全距离发现敌人。<br/>"

[Withdraw X2AbilityTemplate]
+LocFriendlyName="撤退!"
+LocLongDescription="命令一名士兵尝试从他们当前的位置进行战术撤退，使他们可以进行一次防御性行动。"
+LocHelpText="命令一名士兵尝试从他们当前的位置进行战术撤退，使他们可以进行一次防御性行动。"
+LocFlyOverText="撤退!"
+LocPromotionPopupText="<Bullet/> 命令一名士兵尝试从他们当前的位置进行战术撤退，使他们可以进行一次防御性行动。士兵通常会尝试撤退到更安全的地方或者躲避。<br/><Bullet/>五回合冷却时间。"

[OfficerMark X2AbilityTemplate]
+LocFriendlyName="集火目标!"
+LocLongDescription="标记一个敌人进行集火，友方单位攻击该目标会获得+15的命中率。3回合冷却。"
+LocHelpText="标记一个敌人进行集火，友方单位攻击该目标会获得+15的命中率。3回合冷却。"
+LocFlyOverText="集火目标!"
+LocPromotionPopupText="<Bullet/>标记一个敌人进行集火，友方单位攻击该目标会获得+15的命中率。3回合冷却。<br/>"	

[CommandPresence_O X2AbilityTemplate]
+LocFriendlyName="现场指挥"
+LocLongDescription="为整个小队提供+15意志力。"
+LocHelpText="为整个小队提供+15意志力。"
+LocFlyOverText="现场指挥"
+LocPromotionPopupText="<Bullet/>为整个小队提供+15意志力。<br/>"

[CombatOrders_O X2AbilityTemplate]
+LocFriendlyName="战斗命令"
+LocLongDescription="为整个小队提供+5防御力。"
+LocHelpText="为整个小队提供+5防御力。"
+LocFlyOverText="战斗命令"
+LocPromotionPopupText="<Bullet/>为整个小队提供+5防御力。<br/>"

[TakeCover_O X2AbilityTemplate]
+LocFriendlyName="寻找掩体!"
+LocLongDescription="指导士兵更好地利用他们的掩体。+45防御。"
+LocHelpText="指导士兵更好地利用他们的掩体。+45防御。"
+LocFlyOverText="寻找掩体!"
+LocPromotionPopupText="指导士兵更好地利用他们的掩体。+45防御。"

[Charge_O X2AbilityTemplate]
+LocFriendlyName="冲锋!"
+LocLongDescription="吹响冲锋的号角，全体友军移动力+2"
+LocHelpText="Officer 吹响冲锋的号角，全体友军移动力+2"
+LocFlyOverText="冲锋!"
+LocPromotionPopupText="吹响冲锋的号角，全体友军移动力+2"

[Appoint_O X2AbilityTemplate]
+LocFriendlyName="任命副官"
+LocLongDescription="任命一名士兵为副官。这名士兵将在战斗期间获得+15%的命中，25点闪避，副武器伤害+2。只能使用一次，并且不会破坏隐蔽。"
+LocHelpText="任命一名士兵为副官。这名士兵将在战斗期间获得+15%的命中，25点闪避，副武器伤害+2。只能使用一次，并且不会破坏隐蔽。"
+LocFlyOverText="Appoint DSIC"
+LocPromotionPopupText="任命一名士兵为副官。这名士兵将在战斗期间获得+15%的命中，25点闪避，副武器伤害+2。只能使用一次，并且不会破坏隐蔽。<br/>"

[RevisedTraining X2AbilityTemplate]
+LocFriendlyName="训练计划"
+LocLongDescription="通过对军官进行进一步的训练，使他们能够正确地研究变种人部队，评估他们的弱点。获得+5防御加成，以及对敌人造成暴击的几率增加5%。"
+LocHelpText="防御力+5，暴击率+5%"
+LocFlyOverText="训练计划"
+LocPromotionPopupText="防御力+5，暴击率+5%"

[RevisedTraining X2SoldierAbilityUnlockTemplate]
+DisplayName="军官: 训练计划"
+Summary="防御力+5，暴击率+5%"

[InitialTraining X2AbilityTemplate]
+LocFriendlyName="副武器训练"
+LocLongDescription="修订后的军官培训使他们在战斗中使用副武器的效率略有提高。所有副武器伤害+1。"
+LocHelpText="军官的副武器伤害+1。"
+LocFlyOverText="训练计划"
+LocPromotionPopupText="军官的副武器伤害+1。"

[InitialTraining X2SoldierAbilityUnlockTemplate]
+DisplayName="军官: 副武器训练"
+Summary="军官的副武器伤害+1。"

[Quickdraw X2AbilityTemplate]
LocFriendlyName="快速拔枪"
LocLongDescription="使用第一个行动点进行副武器攻击不再结束你的回合。"
LocHelpText="使用第一个行动点进行副武器攻击不再结束你的回合。"
LocFlyOverText="快速拔枪"
LocPromotionPopupText="使用第一个行动点进行副武器攻击不再结束你的回合。"
